alert(`
      10.З клавіатури вводиться вартість одиниці товару. 
      Поки користувач не введе суму грошей, яка достатня для купівлі товару 
      або не відмовиться від купівлі давати можливість вводити суму грошей.
`);  

let priceProduct = parseFloat(prompt(`Введіть вартість товару`))
let sum = 0
do {
  let res = parseInt(prompt(`Для відмови від покупки натисніть 1, для внесення грошей натисніть 2`) ) 
  if(res === 1) break
  let many = parseFloat(prompt(`Заплатіть гроші`))
  sum += many
} while (sum < priceProduct);