// Задача 1. Дано клас PhoneNumber. Створити функцію перетворення до string, при якому на основі
// номера виводиться оператор (050….  MTC, 096…  Kyivstar, ….)

// Задача 2. Дано Shop -- клас, що містить список товарів (масив об’єктів класу Product (назва, ціна,
// кількість одиниць). Додати можливість ітератора до класу Shop, щоб при ітеруванні для кожного
// елемента виводився рядок «товар-загальна вартість»

// Задача 3. Створити генератор, який би випадковим чином поступово генерував вказану кількість
// парних чисел.

// Задача 4. Використовуючи один з АРІ
// https://github.com/public-apis/public-apis#animals
// та функцію fetch організувати завантаження та відображення даних