alert(`
5. На екрані виводиться меню: 
1. Сказати «Привіт». 
2. Сказати «Зачекай». 
3. Сказати «До побачення». 
4. Вихід.
Шляхом вибору пунктів меню виводити відповідні повідомлення, поки не буде вибрано пункт номер 4.
`);


let num;
do {
	num = parseInt(
		prompt(`
  1. Сказати «Привіт». \n
  2. Сказати «Зачекай». \n
  3. Сказати «До побачення». \n 
  4. Вихід.
  Виберіть пункт меню
  `)
	);
	let str;
	switch (num) {
		case 1:
			str = "Привіт";
			break;
		case 2:
			str = "Зачекай";
			break;
		case 3:
			str = "До побачення";
			break;
		case 4:
			str = "Бувай";
			break;
	}
	alert(str);
} while (num !== 4);
