
alert("14. Каса. Користувачу повідомляють суму від 50 до 500 грн, яку йому треба сплатити. Користувач поступово вводить суму грошей до тих пір, поки суми не буде достатньо для оплати товарів (кожного разу користувачу повідомляють, яку ще суму потрібно ввести). ")



let randomSum = 50 + Math.floor(Math.random()*451)
 while (randomSum) {
   let num =  parseFloat(prompt(`Вам потрібно сплатити ще ${randomSum},введіть суму яку сплачуєте`))
   randomSum -= num
   if(randomSum <= 0){
    alert('Вітаю.Ви сплатили всю суму')
    break
   }
 }
